Repository: pathwar/pathwar
Catalog: challenges/web/training-http/front/translations/*/LC_MESSAGES/messages.po
Languages: fr_fr

source: Home
fr_fr: Accueil

source: HTTP Methods
fr_fr: Méthodes HTTP

source: HTTP Headers
fr_fr: Entêtes HTTP

source: HTTP Redirection
fr_fr: Redirection HTTP

source: HTTP Cookies
fr_fr: Cookies HTTP

source: Well done!
fr_fr: Bien joué!

source: This page
fr_fr: Cette page

source: expects a POST request with two parameters, login and password, but you won't find anywhere on the page to input these parameters.
fr_fr: attend une requête de type POST contenant deux paramètres: login et password, mais vous ne trouverez pas sur cette page de champs de formulaire avec ces paramètres.

source: Instead, you'll have to complete this request manually with curl (look at the -d option).
fr_fr: Cous devrez compléter cette requête manuellement avec curl (Regardez le paramètre -d).

source: W00t! Seems you are a real hacker!
fr_fr: Yeah! Vous devez être un vrai hacker!

source: Try to change your User-Agent to <b>Sup3rH4x0RBr0ws3r</b> to get the passphrase !
fr_fr: Afin d'obtenir la phrase de validation, essayez de changer votre User-Agent pour <b>Sup3rH4x0RBr0ws3r</b>!

source: HTTP redirection
fr_fr: Redirection HTTP

source: Congrats! The passphrase is
fr_fr: Félicitations, la phrase clef est

source: Try to set the value of the cookie <b>chocolate</b> to <b>isgood</b> !
fr_fr: Essayez de donner la valeur <b>isgood</b> au cookie <b>chocolate</b>!

source: Training HTTP
fr_fr: Entraînement HTTP

source: HTTP is a client-server protocol commonly used by web browsers (or HTTP clients) and web servers to communicate.
fr_fr: HTTP est un protocole client-serveur utilisé principalement pour la communication entre les navigateurs web (ou clients HTTP) et les serveurs web.

source: This tutorial will introduce you to the basics of the protocol (methods, headers, and modifications).
fr_fr: Ce tutoriel introduira les bases du protocole (méthodes, entêtes et modifications).

source: Once done, go check the RFCs 1945, and 7230 to 7235 (and a few others) for an in-depth explanation of the protocol. If you don't know how to find an RFC, google is your friend.
fr_fr: Une fois fait, cherchez les RFcs 1945 et 7230 à 7235 (et quelques autres) pour une exploration en profondeur du protocole. Si vous ne savez pas comment trouver une RFC, Google est votre ami.

source: HTTP offers multiple methods (with some extensions, like WebDAV, but you won't see them much).
fr_fr: HTTP propose plusieurs méthodes (avec des extensions, comme WebDAV dont l'usage devient assez rare).

source: The five most used are:
fr_fr: Les cinq plus utilisés sont:

source: Get a resource specified by the request URI. Parameters can be passed in the query string
fr_fr: Récupère la ressource spécifié par l'adresse de la requête (URL). Des paramètres peuvent être passés dans la chaîne de requête (Query string).

source: Send data to a server (for example, the content of a form). Parameters are passed in the body of the requests.
fr_fr: Envoie des données au serveur (Par exemple, le contenu d'un formulaire). Les paramètres sont transmis dans le corps (body) de la requête.

source: Used to create a resource at the requested URI. Data is passed inside the body of the request.
fr_fr: Utilisé pour créer un enregistrement à l'adresse indiquée. Les données sont transmises dans le corps de la requête.

source: The opposite of PUT. Used to delete the resource at the request URI.
fr_fr: Le contraire de PUT. Utilisé pour supprimer un enregistrement.

source: Retrieve only the response headers, without the body.
fr_fr: Récupère seulement les entêtes (headers), sans le corps (body).

source: Request Headers
fr_fr: Entêtes de requête

source: When a client send a request to a server, it can send headers to give more information about the request (e.g. languages supported by the client, hostname of the requested website, stored cookies).
fr_fr: Quand un client requête un serveur, il peut transmettre des entête pour indiquer plus d'informations à propos de la requête. (les languages supportés par le client, le nom d'hôte du site voulu, les cookies).

source: You can easily change the request headers sent by your browser with the help of an extension or a proxy that intercepts the requests it makes.
fr_fr: Vous pouvez facilement changer les entêtes de requête envoyés par votre navigateur avec l'aide d'une extension ou d'un proxy.

source: Response Headers
fr_fr: Entêtes de réponse

source: When a web server sends a response to a client, it can send along a few response headers, containing information about the response (like its size), or instructions for the browser, e.g. if, or for how long, it should cache the page.
fr_fr: Quand un serveur web envoie une réponse au client, il peut transmettre quelques entêtes de réponse contenant des informations sur celle-ci (comme sa taille), ou des instructions pour le navigateur. Par exemple si et pour combien de temps il doit mettre ne cache la réponse.

source: This page has sent you a custom header containing a passphrase. See if you can find it! (Tip: You can use the debug console of your browser.)
fr_fr: Cette page vous envoie en entête personnalisé. Voyez si vous pouvez le trouver! (Astuce: Vous pouvez utiliser la console de débugage de votre navigateur.)

source: As seen previously, web servers can send HTTP headers to the client.
fr_fr: Comme vu précédemment, les serveurs web peuvent transmettre des entêtes HTTP aux clients.

source: A commonly used header is
fr_fr: Un entête fréquemment utilisé est:

source: This header is used to redirect the client to another page or website (for example, to redirect the user to their profile page on succesful login).
fr_fr: Cet entête est utilisé pour rediriger le client sur une autre page (par exemple pour le rediriger vers sa page de profile après une connexion réussie).

source: The following link will send your browser an HTTP redirection to this page that will automatically be followed.
fr_fr: Le lien suivant va envoyer à votre navigateur une redirection HTTP vers la page en cours. Cette redirection sera automatiquement suivie.

source: HTTP clients are not required to follow redirections. For example, curl does not follow them by default.
fr_fr: Les clients HTTP ne sont pas obligés de suivre les redirections. Curl ne le fait pas par défaut.

source: Try requesting the redirection page with curl to get the passphrase.
fr_fr: Essayez de requêter cette page de redirection avec curl pour obtenir la phrase clef.

source: Basics
fr_fr: Bases

source: HTTP itself is a stateless protocol (meaning that each request is independent), which is problematic for most web applications, as they need to keep track of users' sessions – for example, whether the user is logged in, and what products they've added to their shopping cart.
fr_fr: HTTP lui même est un protocole "sans état" (stateless). Ce qui signifie que chaque requête est indépendante. C'est un problème pour la majorité des applications web comme elles doivent suivre les sessions utilisateurs. Par exemple: l'utilisateur est-il authentifié, quels produits a-t-il déjà mis dans son panier.

source: To bypass this limitations, HTTP cookies were created.
fr_fr: Pour outrepasser ces limitations, les cookies ont été créés.

source: Cookies are automatically sent by the client with the header 'Cookie' containing all the valid cookies for the current domain, separated by a semicolon. (You will have the occasion to study this behaviour later in some levels :)). Using the above example, any subsequent request to foo.com will include the two cookies set by the server:
fr_fr: Les cookies sont automatiquement envoyés par le client avec l'entête 'Cookie' qui contient tous les cookies valides pour le domaine en question, séparés par un poinjt virgule. (Vous aurez l'occasion d'étudier le méchanisme des cookies dans certains niveaux :) ) . En utilisant l'exemple ci dessus, une requête subséquente vers le site foo.com incluerait ces deux cookies prévus par le serveur:

source: Cookies Manipulation
fr_fr: Manipulation des cookies

source: When you opened this page for the first time, the server sent a cookie named
fr_fr: Quand vous ouvrez cette page pour la première fois, le serveur transmet un cookie nommé

source: to your browser
fr_fr: à votre navigateur

source: As cookie are stored client-side, you can easily modify or delete them.
fr_fr: Comme un cookie est stocké du coté du client, vous pouvez facilement les modifier ou les supprimer

source: There is a lots of way to do this, but the simplest is to use a browser extensions (for Chrome or Chromium, you can use EditThisCookie, for other browsers, check
fr_fr: Il y a plusieurs façons de le faire. Le plus simple est d'utiliser une extension du navigateur (Pour Chrome ou Chromium, vous pouvez utiliser EditThisCookie, pour les autres navigateurs recherchez

source: here
fr_fr: ici
