Repository: pathwar/pathwar
Catalog: challenges/web/training-sqli/front/translations/*/LC_MESSAGES/messages.po
Languages: fr_fr

source: (this is not the challenge passphrase, just the current mysql user password)
fr_fr: (Ce n'est pas la phrase de validation du challenge. C'est le mot de passe de l'utilisateur dans la base de données)

source: A SQL injection is a vulnerability commonly found on websites allowing an attacker to inject arbitrary content into a SQL request due to a lack of sanitization of user input.
fr_fr: Une injection SQL est une vulnérabilité fréquemment trouvée sur les sites web. Elle permet à l'attaquant d'injecter du code SQL arbitraire en raison d'un manque de nettoyage des entrées venant de l'utilisateur.

source: But you don't know their password. (Luckily or not :)), the login form is vulnerable to a SQL injection!
fr_fr: Mais vous ne connaissez pas son mot de passe (heureusement ... ou pas :) ). Le formulaire d'authentification est vulnérable à une injection SQL!

source: Either the login or the password is wrong!
fr_fr: Identifiant ou mot de passe incorrect!

source: First injection
fr_fr: Première injection

source: Hey! What are you doing here? You are not the admin!
fr_fr: Hey! Que faites vous ici! Vous n'êtes pas l'admin!

source: Home
fr_fr: Accueil

source: In case you have forgotten it, your password is:
fr_fr: Si vous l'aviez oublié, votre mot de passe est:

source: In this training level, you'll get the hang of writing basic SQL injections.
fr_fr: Dans ce niveau d'entraînement , vous allez vous familiariser avec des injections SQL basiques.

source: MySQL Documentation
fr_fr: Documentation MySQL

source: SQLi training
fr_fr: Entraînement SQLi

source: Second injection
fr_fr: Deuxième injection

source: Sign in
fr_fr: Authentification

source: Some resources on the subject:
fr_fr: Quelques ressources sur ce sujet:

source: TIP
fr_fr: ASTUCE

source: The request looks like this:
fr_fr: La requête a cette forme:

source: The request you must exploit looks like this:
fr_fr: La requête que vous devez hacker a cette forme:

source: This time, the admin has secured the website by removing their account from the database. Prove them wrong and login with their account !
fr_fr: Cette fois, l'administrateur a sécurisé son site web en supprimant son compte de la base de données. Montrez lui que ce n'est pas suffisant, et connectez vous avec son compte!

source: Try to exploit it to connect as the admin! (<b>Hint</b>: Take a look at the OR keyword.)
fr_fr: Essayez d'hacker ça pour vous connecter en tant qu'admin! (<b>ASTUCE</b>: Regardez comment fonctionne "OR" dans le language SQL)

source: Welcome
fr_fr: Bienvenue

source: Welcome to the SQL Injection training grounds!
fr_fr: Bienvenue au niveaux d'entraînement aux injections SQL!

source: What are the consequences?
fr_fr: Quelles conséquences?

source: What is a SQL injection?
fr_fr: Qu'est-ce qu'une injection SQL?

source: When you find a website vulnerable to a SQL injection, you can do pretty much whatever you want with its database. Depending on where the injection is, you can list passwords for all users, bypass a login form, or sometimes even execute arbitrary code on the server!
fr_fr: Si vous trouvez un site vulnérable à une injection SQL, vous pourrez faire à peu près ce que vous voulez avec sa base de données. En fonction d'où se place l'injection, vous pourriez lister les mots de passe des utilisateurs, outre-passer l'authentification, et parfois même exécuter du code arbitraire sur le serveur!

source: You need to login as the admin user again.
fr_fr: Vous devez à nouveau vous connecter en tant qu'admin.

source: You need to login as the admin user.
fr_fr: Vous devez vous connecter avec l'utilisateur admin.

source: take a look at the mysql documentation for UNION.
fr_fr: regardez la documentation MySQL pour le connecteur UNION.
