Repository: pathwar/pathwar
Catalog: challenges/web/training-brute/front/translations/*/LC_MESSAGES/messages.po
Languages: fr_fr

source: Bruteforce
fr_fr: Force brute

source: The goal of this training is to learn how to write a simple brute force script.
fr_fr: L'objectif de cet exercice est d'apprendre à écrire un simple script de force brute.

source: You shall not pass!
fr_fr: Vous ne passerez pas!

source: Wisely done! The passphrase is
fr_fr: Bien joué! La phrase clef est

source: Invalid password, young mage.
fr_fr: Mauvais mot de passe, jeune mage.

source: Tools
fr_fr: Outils

source: <b>Network request tool.</b> For this training, you'll have to make several HTTP requests. curl can be handy, but you can use any command or tool you wish.
fr_fr: <b>Outils pour créer des requêtes</b> Dans cet exercice, vous devrez faire beaucoup de requêtes HTTP. curl peur être utile, mais utilisez les commandes et outils qui vous conviennent.

source: <b>Programmatic iteration.</b> At the core of a brute-force attack is repetition (think battering ram). Here's how to perform a loop in bash:
fr_fr: <b>Itération programmée </b> Le coeur de l'attaque en force brute est la répétition (pensez au bélier qui frappe une porte). Voici comment faire une boucle en bash:

source: Warning: <i>echo $i</i> is not the same as <i>echo -n $i</i>.
fr_fr: Attention <i>echo $i</i> n'est pas léquivalent de <i>echo -n $i</i>.

source: You'll also need to generate a MD5 hash from a number (man md5sum, <a href="http://www.php.net/manual/en/function.md5.php">php.net</a>).
fr_fr: Vous devrez aussi générer le Hash MD5 d'un nombre (man md5sum, <a href="http://www.php.net/manual/fr/function.md5.php">php.net</a>).

source: The action field, which indicates the script called when the form is submitted (here, index.php).
fr_fr: Le champs action qui indique le script appelé lorsque le formulaire est soumis (ici index.php).

source: The method field, which indicates the type of the HTTP query to be made. In this case, we're using GET, so we must include all of our query parameters in the requested URL. Here's how we format and encode them:
fr_fr: Le champs method, qui indique le type de requête HTTP à faire. Dans ce cas, nous utilisons GET, donc les paramètres de requête doivent être inclus dans l'URL. Voici comment les formater et les encoder:

source: So, whenever the form is submitted, the page <a href="/index.php?pass=input_value">/index.php?pass=input_value</a> gets called. (Note that you can request this link directly without submitting the form.)
fr_fr: Donc, une fois que le formulaire est soumis, la page <a href="/index.php?pass=input_value">/index.php?pass=input_value</a> est appelée. (Notez que vous pouvez requêter ce lien directement sans soumettre le formulaire.)

source: Here's the PHP code that checks the password:
fr_fr: Voici le code PHP qui sert à vérifier le mot de passe:

source: You now have to find the hash using your brute force script. <i>For even the very wise cannot see all ends...</i>
fr_fr: Vous devez à présent trouver le hash en utilisant votre script de force brute. <i>Même les grands sages ne peuvent connaître toutes les fins...</i>
